52n-ses-integration-test/src/test/resources/org/n52/ses/common/integration/test/Overshoot_Subscribe2.xml

<SOAP-ENV:Envelope xmlns:ses="http://www.opengis.net/ses/0.0"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:essf="http://www.opengis.net/es-sf/0.0"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl-soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
	xmlns:wsrf-r="http://docs.oasis-open.org/wsrf/r-2" xmlns:wsrf-rl="http://docs.oasis-open.org/wsrf/rl-2"
	xmlns:wsrf-bf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wsrf-rp="http://docs.oasis-open.org/wsrf/rp-2"
	xmlns:wsrmd="http://docs.oasis-open.org/wsrf/rmd-1" xmlns:wsn-b="http://docs.oasis-open.org/wsn/b-2"
	xmlns:wsn-br="http://docs.oasis-open.org/wsn/br-2" xmlns:wsntw="http://docs.oasis-open.org/wsn/bw-2"
	xmlns:wsn-t="http://docs.oasis-open.org/wsn/t-1" xmlns:muws1="http://docs.oasis-open.org/wsdm/muws1-2.xsd"
	xmlns:muws2="http://docs.oasis-open.org/wsdm/muws2-2.xsd" xmlns:sml="http://www.opengis.net/sensorML/1.0.1"
	xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:xlink="http://www.w3.org/1999/xlink"
	xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header>
		<wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest
		</wsa:Action>
		<wsa:To>http://192.168.1.60:7080/52n-ses-1.1.0-rc.2-SNAPSHOT/services/Broker
		</wsa:To>
		<wsa:From>
			<wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous
			</wsa:Address>
		</wsa:From>
		<wsa:MessageID>6c7b0f45-e735-4727-9984-2fc699436834</wsa:MessageID>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<wsn-b:Subscribe>
			<wsn-b:ConsumerReference>
				<wsa:Address>http://192.168.1.60:8080/SES-WNS-Translator/Translator_Servlet
				</wsa:Address>
			</wsn-b:ConsumerReference>
			<wsn-b:Filter>
				<wsn-b:MessageContent Dialect="http://www.opengis.net/ses/filter/level3">
					<EML xmlns="http://www.opengis.net/eml/0.0.1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
						xsi:schemaLocation="http://www.opengis.net/eml/0.0.1 3111_XSDeml0.0.1OGC-EML-0_0_1-eml.xsd">
						<SimplePatterns>
							<SimplePattern inputName="BAW_META" patternID="BAW_META">
								<SelectFunctions>
									<SelectFunction newEventName="BAW_META">
										<NotifyOnSelect>
											<Message>&lt;format&gt;SES_OUTPUT&lt;/format&gt;
												&lt;userID&gt;223&lt;/userID&gt;</Message>
										</NotifyOnSelect>
									</SelectFunction>
								</SelectFunctions>
								<PropertyRestrictions>
									<PropertyRestriction>
										<name>observedProperty</name>
										<value>THIS_OBS_PROP_DOES_NOT_EXIST</value>
									</PropertyRestriction>
								</PropertyRestrictions>
							</SimplePattern>

							<SimplePattern inputName="input"
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_stream">
								<SelectFunctions>
									<SelectFunction createCausality="false"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot">
										<SelectEvent eventName="input" />
									</SelectFunction>
								</SelectFunctions>
								<View>
									<LengthView>
										<EventCount>1</EventCount>
									</LengthView>
								</View>
								<Guard>
									<fes:Filter xmlns:fes="http://www.opengis.net/fes/2.0">
										<fes:PropertyIsGreaterThan>
											<fes:ValueReference>input/doubleValue</fes:ValueReference>
											<fes:Literal>460</fes:Literal>
										</fes:PropertyIsGreaterThan>
									</fes:Filter>
								</Guard>
								<PropertyRestrictions>
									<PropertyRestriction>
										<name>observedProperty</name>
										<value>Wasserstand</value>
									</PropertyRestriction>
									<PropertyRestriction>
										<name>sensorID</name>
										<value>-2041891732</value>
									</PropertyRestriction>
								</PropertyRestrictions>
							</SimplePattern>
							<SimplePattern inputName="input"
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_stream">
								<SelectFunctions>
									<SelectFunction createCausality="false"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot">
										<SelectEvent eventName="input" />
									</SelectFunction>
								</SelectFunctions>
								<View>
									<LengthView>
										<EventCount>1</EventCount>
									</LengthView>
								</View>
								<Guard>
									<fes:Filter xmlns:fes="http://www.opengis.net/fes/2.0">
										<fes:PropertyIsLessThanOrEqualTo>
											<fes:ValueReference>input/doubleValue</fes:ValueReference>
											<fes:Literal>460</fes:Literal>
										</fes:PropertyIsLessThanOrEqualTo>
									</fes:Filter>
								</Guard>
								<PropertyRestrictions>
									<PropertyRestriction>
										<name>observedProperty</name>
										<value>Wasserstand</value>
									</PropertyRestriction>
									<PropertyRestriction>
										<name>sensorID</name>
										<value>-2041891732</value>
									</PropertyRestriction>
								</PropertyRestrictions>
							</SimplePattern>
						</SimplePatterns>
						<ComplexPatterns>
							<!-- Einstiegsklausel -->
							<ComplexPattern
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_notification_stream">
								<SelectFunctions>
									<SelectFunction createCausality="true"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_notification"
										outputName="Wasserstand_LIST_AUF_SYLT_over_undershoot_enter">
										<NotifyOnSelect>
											<Message>Einstiegsklausel</Message>
										</NotifyOnSelect>
									</SelectFunction>
								</SelectFunctions>
								<StructuralOperator>
									<BEFORE />
								</StructuralOperator>
								<FirstPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_stream</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</FirstPattern>
								<SecondPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_stream</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</SecondPattern>
							</ComplexPattern>
							<ComplexPattern
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_notification">
								<SelectFunctions>
									<SelectFunction createCausality="true"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_notification_stream"
										outputName="Wasserstand_LIST_AUF_SYLT_over_undershoot_exit">
										<NotifyOnSelect>
											<Message>Ausstiegsklausel</Message>
										</NotifyOnSelect>
									</SelectFunction>
								</SelectFunctions>
								<StructuralOperator>
									<BEFORE />
								</StructuralOperator>
								<FirstPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_stream</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</FirstPattern>
								<SecondPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_stream</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</SecondPattern>
							</ComplexPattern>
						</ComplexPatterns>
						<TimerPatterns />
						<RepetitivePatterns />
					</EML>
				</wsn-b:MessageContent>
			</wsn-b:Filter>
			<wsn-b:InitialTerminationTime xsd:nil="true" />
		</wsn-b:Subscribe>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>